//
// Created by Inori on 2020/3/9.
//
// 位运算
// 取一个整数a从右端开始的4-7位

/**
 * 1、先使a右移4位
 * 2、设置一个低于4位全为1，其余为0的数
 *      ~（~0<<4）
 *      ~0的全部二进制位为1，右移4位，这样右端低于4位为0
 *          0:0000....000000
 *         ~0:1111....111111
 *      ~0<<4:1111....110000
 *   ~(~0<<4):0000....001111
 * 3、将上面1、2进行&运算
 *      (a>>4)&~(~0<<4)
 *
 * 4、可以认知一定从右面第m位开始取其右面n位。
 *      只需将程序中的"b=a>>4"改成"b=a>>(m-n+1)"
 *      "c=~(~0<<4)"改成"c=~(~0<<n)"即可
 */
#include <stdio.h>

void main()
{
    unsigned a = 217,b,c,d;
    b = a >> 4;
    c = ~(~0<<4);
    d = b&c;
    printf("%o,%d\n%o,%d\n",a,a,d,d);
}